// -----// IR Dump After StablehloLegalizeToHloPass (stablehlo-legalize-to-hlo) //----- //
module {
  func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
    %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    return %0 : tensor<3x3xf32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
  %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  return %0 : tensor<3x3xf32>
}

// -----// IR Dump After LegalizeControlFlowPass (mhlo-legalize-control-flow) //----- //
func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
  %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  return %0 : tensor<3x3xf32>
}

// -----// IR Dump After TopLevelSCFToCFG (iree-top-level-scf-to-cfg) //----- //
func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
  %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  return %0 : tensor<3x3xf32>
}

// -----// IR Dump After MHLOToMHLOPreprocessing (iree-mhlo-to-mhlo-preprocessing) //----- //
func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
  %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  return %0 : tensor<3x3xf32>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
  %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  return %0 : tensor<3x3xf32>
}

// -----// IR Dump After ShapeToShapeLowering (shape-to-shape-lowering) //----- //
func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
  %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  return %0 : tensor<3x3xf32>
}

// -----// IR Dump After ConvertShapeToStandard (convert-shape-to-std) //----- //
module {
  func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
    %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    return %0 : tensor<3x3xf32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
  %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  return %0 : tensor<3x3xf32>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
  %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  return %0 : tensor<3x3xf32>
}

// -----// IR Dump After Inliner (inline) //----- //
module {
  func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
    %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    return %0 : tensor<3x3xf32>
  }
}


// -----// IR Dump After DemoteI64ToI32 (iree-util-demote-i64-to-i32) //----- //
module {
  func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
    %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    return %0 : tensor<3x3xf32>
  }
}


// -----// IR Dump After DemoteF64ToF32 (iree-util-demote-f64-to-f32) //----- //
module {
  func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
    %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    return %0 : tensor<3x3xf32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
  %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  return %0 : tensor<3x3xf32>
}

// -----// IR Dump After CSE (cse) //----- //
func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
  %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  return %0 : tensor<3x3xf32>
}

// -----// IR Dump After HloLegalizeShapeComputationsPass (hlo-legalize-shape-computations) //----- //
func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
  %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  return %0 : tensor<3x3xf32>
}

// -----// IR Dump After ConvertMHLOToLinalgExt (iree-mhlo-to-linalg-ext) //----- //
func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
  %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  return %0 : tensor<3x3xf32>
}

// -----// IR Dump After ConvertMHLOToLinalgOnTensors (iree-mhlo-to-linalg-on-tensors) //----- //
module {
  func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
    %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    return %0 : tensor<3x3xf32>
  }
}


// -----// IR Dump After ReconcileUnrealizedCasts (reconcile-unrealized-casts) //----- //
module {
  func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
    %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    return %0 : tensor<3x3xf32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
  %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  return %0 : tensor<3x3xf32>
}

// -----// IR Dump After VerifyCompilerMHLOInputLegality (iree-mhlo-verify-compiler-input-legality) //----- //
module {
  func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
    %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    return %0 : tensor<3x3xf32>
  }
}


// -----// IR Dump After IREEImportPublic (iree-import-public) //----- //
module {
  func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
    %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    return %0 : tensor<3x3xf32>
  }
}


// -----// IR Dump After ImportMLProgram (iree-import-ml-program) //----- //
module {
  func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
    %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    return %0 : tensor<3x3xf32>
  }
}


// -----// IR Dump After SanitizeModuleNames (iree-sanitize-module-names) //----- //
module {
  func.func @matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
    %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    return %0 : tensor<3x3xf32>
  }
}


// -----// IR Dump After mlir::iree_compiler::IREE::ABI::WrapEntryPointsPass (iree-abi-wrap-entry-points) //----- //
module {
  func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
    %3 = call @_matmul_static(%0, %1, %2) : (tensor<3x5xf32>, tensor<5x3xf32>, tensor<3x3xf32>) -> tensor<3x3xf32>
    %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
  func.func private @_matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
    %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    return %0 : tensor<3x3xf32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func private @_matmul_static(%arg0: tensor<3x5xf32>, %arg1: tensor<5x3xf32>, %arg2: tensor<3x3xf32>) -> tensor<3x3xf32> {
  %0 = linalg.matmul ins(%arg0, %arg1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%arg2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  return %0 : tensor<3x3xf32>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = call @_matmul_static(%0, %1, %2) : (tensor<3x5xf32>, tensor<5x3xf32>, tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After Inliner (inline) //----- //
module {
  func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After CSE (cse) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After SymbolDCE (symbol-dce) //----- //
module {
  func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After DemoteF64ToF32 (iree-util-demote-f64-to-f32) //----- //
module {
  func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After DetachElementwiseFromNamedOps (iree-flow-detach-elementwise-from-named-ops) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After LinalgNamedOpConversion (linalg-named-op-conversion) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After Convert1X1FilterConv2DToMatmul (iree-flow-convert-1x1-filter-conv2d-to-matmul) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After VerifyInputLegality (iree-verify-input-legality) //----- //
module {
  func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After ExpandTensorShapes (iree-flow-expand-tensor-shapes) //----- //
module {
  func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After SimplifyGlobalAccesses (iree-util-simplify-global-accesses) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After ApplyPatterns (iree-util-apply-patterns) //----- //
module attributes {iree.fixedpoint.iteration = 0 : index} {
  func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After FoldGlobals (iree-util-fold-globals) //----- //
module attributes {iree.fixedpoint.iteration = 0 : index} {
  func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After IPO (iree-util-ipo) //----- //
module attributes {iree.fixedpoint.iteration = 0 : index} {
  func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After CSE (cse) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After FixedPointIterator (iree-util-fixed-point-iterator) //----- //
module {
  func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After TensorPadToTensorInsertSlice (iree-flow-tensor-pad-to-tensor-insert-slice) //----- //
module {
  func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After ConvertElementwiseToLinalg (convert-elementwise-to-linalg) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After LinalgFoldUnitExtentDims (linalg-fold-unit-extent-dims) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After InterchangeGenericOps (iree-flow-interchange-generic-ops) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After ResolveShapedTypeResultDims (resolve-shaped-type-result-dims) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After CSE (cse) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After FusionOfTensorOps (iree-flow-fusion-of-tensor-ops) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After LinalgDetensorize (linalg-detensorize) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After CSE (cse) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After CollapseDims (iree-flow-collapse-dims) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After SplitReduction (iree-flow-split-reduction-ops) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After InterchangeGenericOps (iree-flow-interchange-generic-ops) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After FormDispatchRegions (iree-flow-form-dispatch-regions) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %c1 = arith.constant 1 : index
  %c0 = arith.constant 0 : index
  %c3 = arith.constant 3 : index
  %c1_0 = arith.constant 1 : index
  %3 = affine.apply affine_map<()[s0, s1, s2] -> ((s1 - s0) ceildiv s2)>()[%c0, %c3, %c1_0]
  %c0_1 = arith.constant 0 : index
  %c3_2 = arith.constant 3 : index
  %c1_3 = arith.constant 1 : index
  %4 = affine.apply affine_map<()[s0, s1, s2] -> ((s1 - s0) ceildiv s2)>()[%c0_1, %c3_2, %c1_3]
  %c0_4 = arith.constant 0 : index
  %c1_5 = arith.constant 1 : index
  %5 = affine.apply affine_map<()[s0, s1, s2] -> ((s1 - s0) ceildiv s2)>()[%c0_4, %c1, %c1_5]
  %6 = flow.dispatch.region[%3, %4, %5] -> (tensor<3x3xf32>) {
    %8 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    flow.return %8 : tensor<3x3xf32>
  } count(%arg3: index, %arg4: index, %arg5: index) -> (index, index, index) {
    %x, %y, %z = flow.dispatch.workgroup_count_from_dag_root %arg3, %arg4, %arg5
    flow.return %x, %y, %z : index, index, index
  }
  %7 = hal.tensor.export %6 : tensor<3x3xf32> -> !hal.buffer_view
  return %7 : !hal.buffer_view
}

// -----// IR Dump After CollapseDimensions (iree-flow-collapse-dimensions) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %c3 = arith.constant 3 : index
  %c1 = arith.constant 1 : index
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = flow.dispatch.region[%c3, %c3, %c1] -> (tensor<3x3xf32>) {
    %5 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
    flow.return %5 : tensor<3x3xf32>
  } count(%arg3: index, %arg4: index, %arg5: index) -> (index, index, index) {
    %x, %y, %z = flow.dispatch.workgroup_count_from_dag_root %arg3, %arg4, %arg5
    flow.return %x, %y, %z : index, index, index
  }
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After FormDispatchWorkgroups (iree-flow-form-dispatch-workgroups) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %c3 = arith.constant 3 : index
  %c1 = arith.constant 1 : index
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = flow.dispatch.workgroups[%c3, %c3, %c1](%0, %1, %2) : (tensor<3x5xf32>, tensor<5x3xf32>, tensor<3x3xf32>) -> %2 =
      (%arg3: !flow.dispatch.tensor<readonly:tensor<3x5xf32>>, %arg4: !flow.dispatch.tensor<readonly:tensor<5x3xf32>>, %arg5: !flow.dispatch.tensor<readwrite:tensor<3x3xf32>>) {
    %5 = flow.dispatch.tensor.load %arg3, offsets = [0, 0], sizes = [3, 5], strides = [1, 1] : !flow.dispatch.tensor<readonly:tensor<3x5xf32>> -> tensor<3x5xf32>
    %6 = flow.dispatch.tensor.load %arg4, offsets = [0, 0], sizes = [5, 3], strides = [1, 1] : !flow.dispatch.tensor<readonly:tensor<5x3xf32>> -> tensor<5x3xf32>
    %7 = flow.dispatch.tensor.load %arg5, offsets = [0, 0], sizes = [3, 3], strides = [1, 1] : !flow.dispatch.tensor<readwrite:tensor<3x3xf32>> -> tensor<3x3xf32>
    %8 = linalg.matmul ins(%5, %6 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%7 : tensor<3x3xf32>) -> tensor<3x3xf32>
    flow.dispatch.tensor.store %8, %arg5, offsets = [0, 0], sizes = [3, 3], strides = [1, 1] : tensor<3x3xf32> -> !flow.dispatch.tensor<readwrite:tensor<3x3xf32>>
    flow.return
  } count(%arg3: index, %arg4: index, %arg5: index) -> (index, index, index) {
    %x, %y, %z = flow.dispatch.workgroup_count_from_dag_root %arg3, %arg4, %arg5
    flow.return %x, %y, %z : index, index, index
  }
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After CaptureDispatchDynamicDims (iree-flow-capture-dispatch-dynamic-dims) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %c3 = arith.constant 3 : index
  %c1 = arith.constant 1 : index
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = flow.dispatch.workgroups[%c3, %c3, %c1](%0, %1, %2) : (tensor<3x5xf32>, tensor<5x3xf32>, tensor<3x3xf32>) -> %2 =
      (%arg3: !flow.dispatch.tensor<readonly:tensor<3x5xf32>>, %arg4: !flow.dispatch.tensor<readonly:tensor<5x3xf32>>, %arg5: !flow.dispatch.tensor<readwrite:tensor<3x3xf32>>) {
    %5 = flow.dispatch.tensor.load %arg3, offsets = [0, 0], sizes = [3, 5], strides = [1, 1] : !flow.dispatch.tensor<readonly:tensor<3x5xf32>> -> tensor<3x5xf32>
    %6 = flow.dispatch.tensor.load %arg4, offsets = [0, 0], sizes = [5, 3], strides = [1, 1] : !flow.dispatch.tensor<readonly:tensor<5x3xf32>> -> tensor<5x3xf32>
    %7 = flow.dispatch.tensor.load %arg5, offsets = [0, 0], sizes = [3, 3], strides = [1, 1] : !flow.dispatch.tensor<readwrite:tensor<3x3xf32>> -> tensor<3x3xf32>
    %8 = linalg.matmul ins(%5, %6 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%7 : tensor<3x3xf32>) -> tensor<3x3xf32>
    flow.dispatch.tensor.store %8, %arg5, offsets = [0, 0], sizes = [3, 3], strides = [1, 1] : tensor<3x3xf32> -> !flow.dispatch.tensor<readwrite:tensor<3x3xf32>>
    flow.return
  } count(%arg3: index, %arg4: index, %arg5: index) -> (index, index, index) {
    %x, %y, %z = flow.dispatch.workgroup_count_from_dag_root %arg3, %arg4, %arg5
    flow.return %x, %y, %z : index, index, index
  }
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %c3 = arith.constant 3 : index
  %c1 = arith.constant 1 : index
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = flow.dispatch.workgroups[%c3, %c3, %c1](%0, %1, %2) : (tensor<3x5xf32>, tensor<5x3xf32>, tensor<3x3xf32>) -> %2 =
      (%arg3: !flow.dispatch.tensor<readonly:tensor<3x5xf32>>, %arg4: !flow.dispatch.tensor<readonly:tensor<5x3xf32>>, %arg5: !flow.dispatch.tensor<readwrite:tensor<3x3xf32>>) {
    %5 = flow.dispatch.tensor.load %arg3, offsets = [0, 0], sizes = [3, 5], strides = [1, 1] : !flow.dispatch.tensor<readonly:tensor<3x5xf32>> -> tensor<3x5xf32>
    %6 = flow.dispatch.tensor.load %arg4, offsets = [0, 0], sizes = [5, 3], strides = [1, 1] : !flow.dispatch.tensor<readonly:tensor<5x3xf32>> -> tensor<5x3xf32>
    %7 = flow.dispatch.tensor.load %arg5, offsets = [0, 0], sizes = [3, 3], strides = [1, 1] : !flow.dispatch.tensor<readwrite:tensor<3x3xf32>> -> tensor<3x3xf32>
    %8 = linalg.matmul ins(%5, %6 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%7 : tensor<3x3xf32>) -> tensor<3x3xf32>
    flow.dispatch.tensor.store %8, %arg5, offsets = [0, 0], sizes = [3, 3], strides = [1, 1] : tensor<3x3xf32> -> !flow.dispatch.tensor<readwrite:tensor<3x3xf32>>
    flow.return
  } count(%arg3: index, %arg4: index, %arg5: index) -> (index, index, index) {
    %x, %y, %z = flow.dispatch.workgroup_count_from_dag_root %arg3, %arg4, %arg5
    flow.return %x, %y, %z : index, index, index
  }
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After CSE (cse) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %c3 = arith.constant 3 : index
  %c1 = arith.constant 1 : index
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = flow.dispatch.workgroups[%c3, %c3, %c1](%0, %1, %2) : (tensor<3x5xf32>, tensor<5x3xf32>, tensor<3x3xf32>) -> %2 =
      (%arg3: !flow.dispatch.tensor<readonly:tensor<3x5xf32>>, %arg4: !flow.dispatch.tensor<readonly:tensor<5x3xf32>>, %arg5: !flow.dispatch.tensor<readwrite:tensor<3x3xf32>>) {
    %5 = flow.dispatch.tensor.load %arg3, offsets = [0, 0], sizes = [3, 5], strides = [1, 1] : !flow.dispatch.tensor<readonly:tensor<3x5xf32>> -> tensor<3x5xf32>
    %6 = flow.dispatch.tensor.load %arg4, offsets = [0, 0], sizes = [5, 3], strides = [1, 1] : !flow.dispatch.tensor<readonly:tensor<5x3xf32>> -> tensor<5x3xf32>
    %7 = flow.dispatch.tensor.load %arg5, offsets = [0, 0], sizes = [3, 3], strides = [1, 1] : !flow.dispatch.tensor<readwrite:tensor<3x3xf32>> -> tensor<3x3xf32>
    %8 = linalg.matmul ins(%5, %6 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%7 : tensor<3x3xf32>) -> tensor<3x3xf32>
    flow.dispatch.tensor.store %8, %arg5, offsets = [0, 0], sizes = [3, 3], strides = [1, 1] : tensor<3x3xf32> -> !flow.dispatch.tensor<readwrite:tensor<3x3xf32>>
    flow.return
  } count(%arg3: index, %arg4: index, %arg5: index) -> (index, index, index) {
    %x, %y, %z = flow.dispatch.workgroup_count_from_dag_root %arg3, %arg4, %arg5
    flow.return %x, %y, %z : index, index, index
  }
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After InitializeEmptyTensors (iree-flow-initialize-empty-tensors) //----- //
module {
  func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %c3 = arith.constant 3 : index
    %c1 = arith.constant 1 : index
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
    %3 = flow.dispatch.workgroups[%c3, %c3, %c1](%0, %1, %2) : (tensor<3x5xf32>, tensor<5x3xf32>, tensor<3x3xf32>) -> %2 =
        (%arg3: !flow.dispatch.tensor<readonly:tensor<3x5xf32>>, %arg4: !flow.dispatch.tensor<readonly:tensor<5x3xf32>>, %arg5: !flow.dispatch.tensor<readwrite:tensor<3x3xf32>>) {
      %5 = flow.dispatch.tensor.load %arg3, offsets = [0, 0], sizes = [3, 5], strides = [1, 1] : !flow.dispatch.tensor<readonly:tensor<3x5xf32>> -> tensor<3x5xf32>
      %6 = flow.dispatch.tensor.load %arg4, offsets = [0, 0], sizes = [5, 3], strides = [1, 1] : !flow.dispatch.tensor<readonly:tensor<5x3xf32>> -> tensor<5x3xf32>
      %7 = flow.dispatch.tensor.load %arg5, offsets = [0, 0], sizes = [3, 3], strides = [1, 1] : !flow.dispatch.tensor<readwrite:tensor<3x3xf32>> -> tensor<3x3xf32>
      %8 = linalg.matmul ins(%5, %6 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%7 : tensor<3x3xf32>) -> tensor<3x3xf32>
      flow.dispatch.tensor.store %8, %arg5, offsets = [0, 0], sizes = [3, 3], strides = [1, 1] : tensor<3x3xf32> -> !flow.dispatch.tensor<readwrite:tensor<3x3xf32>>
      flow.return
    } count(%arg3: index, %arg4: index, %arg5: index) -> (index, index, index) {
      %x, %y, %z = flow.dispatch.workgroup_count_from_dag_root %arg3, %arg4, %arg5
      flow.return %x, %y, %z : index, index, index
    }
    %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After OutlineDispatchRegions (iree-flow-outline-dispatch-regions) //----- //
module {
  flow.executable private @matmul_static_dispatch_0 {
    flow.executable.export public @matmul_static_dispatch_0_matmul_3x3x5 workgroups(%arg0: index, %arg1: index, %arg2: index) -> (index, index, index) {
      %x, %y, %z = flow.dispatch.workgroup_count_from_dag_root %arg0, %arg1, %arg2
      flow.return %x, %y, %z : index, index, index
    }
    builtin.module {
      func.func @matmul_static_dispatch_0_matmul_3x3x5(%arg0: !flow.dispatch.tensor<readonly:tensor<3x5xf32>>, %arg1: !flow.dispatch.tensor<readonly:tensor<5x3xf32>>, %arg2: !flow.dispatch.tensor<readwrite:tensor<3x3xf32>>) {
        %0 = flow.dispatch.tensor.load %arg0, offsets = [0, 0], sizes = [3, 5], strides = [1, 1] : !flow.dispatch.tensor<readonly:tensor<3x5xf32>> -> tensor<3x5xf32>
        %1 = flow.dispatch.tensor.load %arg1, offsets = [0, 0], sizes = [5, 3], strides = [1, 1] : !flow.dispatch.tensor<readonly:tensor<5x3xf32>> -> tensor<5x3xf32>
        %2 = flow.dispatch.tensor.load %arg2, offsets = [0, 0], sizes = [3, 3], strides = [1, 1] : !flow.dispatch.tensor<readwrite:tensor<3x3xf32>> -> tensor<3x3xf32>
        %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
        flow.dispatch.tensor.store %3, %arg2, offsets = [0, 0], sizes = [3, 3], strides = [1, 1] : tensor<3x3xf32> -> !flow.dispatch.tensor<readwrite:tensor<3x3xf32>>
        return
      }
    }
  }
  func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %c3 = arith.constant 3 : index
    %c1 = arith.constant 1 : index
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
    %3 = flow.dispatch @matmul_static_dispatch_0::@matmul_static_dispatch_0_matmul_3x3x5[%c3, %c3, %c1](%0, %1, %2) : (tensor<3x5xf32>, tensor<5x3xf32>, tensor<3x3xf32>) -> %2
    %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After StripDebugOps (iree-util-strip-debug-ops) //----- //
flow.executable private @matmul_static_dispatch_0 {
  flow.executable.export public @matmul_static_dispatch_0_matmul_3x3x5 workgroups(%arg0: index, %arg1: index, %arg2: index) -> (index, index, index) {
    %x, %y, %z = flow.dispatch.workgroup_count_from_dag_root %arg0, %arg1, %arg2
    flow.return %x, %y, %z : index, index, index
  }
  builtin.module {
    func.func @matmul_static_dispatch_0_matmul_3x3x5(%arg0: !flow.dispatch.tensor<readonly:tensor<3x5xf32>>, %arg1: !flow.dispatch.tensor<readonly:tensor<5x3xf32>>, %arg2: !flow.dispatch.tensor<readwrite:tensor<3x3xf32>>) {
      %0 = flow.dispatch.tensor.load %arg0, offsets = [0, 0], sizes = [3, 5], strides = [1, 1] : !flow.dispatch.tensor<readonly:tensor<3x5xf32>> -> tensor<3x5xf32>
      %1 = flow.dispatch.tensor.load %arg1, offsets = [0, 0], sizes = [5, 3], strides = [1, 1] : !flow.dispatch.tensor<readonly:tensor<5x3xf32>> -> tensor<5x3xf32>
      %2 = flow.dispatch.tensor.load %arg2, offsets = [0, 0], sizes = [3, 3], strides = [1, 1] : !flow.dispatch.tensor<readwrite:tensor<3x3xf32>> -> tensor<3x3xf32>
      %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
      flow.dispatch.tensor.store %3, %arg2, offsets = [0, 0], sizes = [3, 3], strides = [1, 1] : tensor<3x3xf32> -> !flow.dispatch.tensor<readwrite:tensor<3x3xf32>>
      return
    }
  }
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @matmul_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %c3 = arith.constant 3 : index
  %c1 = arith.constant 1 : index
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<3x5xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<5x3xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<3x3xf32>
  %3 = flow.dispatch @matmul_static_dispatch_0::@matmul_static_dispatch_0_matmul_3x3x5[%c3, %c3, %c1](%0, %1, %2) : (tensor<3x5xf32>, tensor<5x3xf32>, tensor<3x3xf32>) -> %2
  %4 = hal.tensor.export %3 : tensor<3x3xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After DeduplicateExecutables (iree-flow-deduplicate-executables) //----- //
module {
  flow.executable private @matmul_static_dispatch_0 {
    flow.executable.export public @matmul_static_dispatch_0_matmul_3x3x5 workgroups(%arg0: index, %arg1: index, %arg2: index) -> (index, index, index) {
      %x, %y, %z = flow.dispatch.workgroup_count_from_dag_root %arg0, %arg1, %arg2
      flow.return %x, %y, %z : index, index, index
    }
    builtin.module {
      func.func @matmul_static_dispatch_0_matmul_3x3x5(%arg0: !flow.dispatch.tensor<readonly:tensor<3x5xf32>>, %arg1: !flow.dispatch.tensor<readonly:tensor<5x3xf32>>, %arg2: !flow.dispatch.tensor<readwrite:tensor<3x3xf32>>) {
        %0 = flow.dispatch.tensor.load %arg0, offsets = [0, 0], sizes = [3, 5], strides = [1, 1] : !flow.dispatch.tensor<readonly:tensor<3x5xf32>> -> tensor<3x5xf32>
        %1 = flow.dispatch.tensor.load %arg1, offsets = [0, 0], sizes = [5, 3], strides = [1, 1] : !flow.dispatch.tensor<readonly:tensor<5x3xf32>> -> tensor<5x3xf32>
        %2 = flow.dispatch.tensor.load %arg2, offsets = [0, 0], sizes = [3, 3], strides = [1, 1] : !flow.dispatch.tensor<readwrite:tensor<3x3xf32>> -> tensor<3x3xf32>
        %3 = linalg.matmul ins(%0, %1 : tensor<3x5xf32>, tensor<5x3xf32>) outs(%2 : tensor<3x3xf32>) -> tensor<3x3xf32>
        flow.dispatch.tensor.store %3, %arg2, offsets = [0, 0], sizes = [3, 3], strides = [1, 1] : tensor<3x3xf32> -> !flow.dispatch.tensor<readwrite:tensor<3x3xf32>>
        return
      }
    }
  }
